package com.joyintech.tams.svreport.pbc.common.enums;

import com.joyintech.framework.util.StringUtil;

public enum PbcDictCodeEnums {
    募集方式_公募("1-公开募集","1"),
    募集方式_私募("2-非公开募集","2"),
    管理方式_集合("1-集合管理","1"),
    管理方式_单独("2-单独管理","2"),
    运行方式_开放式净值型("1-开放式净值型","1"),
    运行方式_开放式非净值型("2-开放式非净值型","2"),
    运行方式_封闭式净值型("3-封闭式净值型","3"),
    运行方式_封闭式非净值型("4-封闭式非净值型","4"),
    产品类型_固定收益类("1-固定收益类","1"),
    产品类型_权益类("2-权益类","2"),
    产品类型_商品及金融衍生品类("3-商品及金融衍生品类","3"),
    产品类型_混合类("4-混合类","4"),
    有("1-有","1"),
    无("2-无","2"),
    是("1-是","1"),
    否("2-否","2"),
    受托职责_主动管理业务("1-主动管理业务","1"),
    受托职责_被动管理业务("2-被动管理业务","2"),
    增信机构类型_住户("1-住户","1"),
    增信机构类型_权益类("2-广义政府","2"),
    增信机构类型_商品及金融衍生品类("3-非金融性企业","3"),
    增信机构类型_混合类("4-金融机构（实体）","4"),
    增信机构类型_境外("6-境外","6"),
    增信形式_内部增级("1-内部增级","1"),
    增信形式_外部增级("2-外部增级","2"),
    增信形式_内外增级("3-内外增级","3"),
    银行非保本理财("1-银行非保本理财","1"),
    银行非保本理财_01("01-银行非保本理财","01"),
    信托公司资管产品("02-信托公司资管产品","02"),
    证券公司及其子公司资管产品("03-证券公司及其子公司资管产品","03"),
    基金管理公司及其子公司专户("04-基金管理公司及其子公司专户","04"),
    期货公司及其子公司资管产品("05-期货公司及其子公司资管产品","05"),
    保险资管产品("06-保险资管产品","06"),
    金融资产投资公司资管产品("07-金融资产投资公司资管产品","07"),
    公募基金("08-公募基金","08"),
    增信机构类型_广义政府("1-广义政府","1"),
    增信机构类型_非金融性公司("2-非金融性公司","2"),
    增信机构类型_金融性公司("3-金融性公司","3"),
    增信机构类型_住户部门("4-住户部门","4"),
    增信机构类型_国外部门("5-国外部门","5");



    private String name;

    private String code;

    PbcDictCodeEnums(String name, String code) {
        this.name = name;
        this.code = code;
    }

    public String getName() {
        return name;
    }

    public String getCode() {
        return code;
    }

    public static String getCodeByName(String name){
        for (PbcDictCodeEnums codeEnums : PbcDictCodeEnums.values()) {
            if(codeEnums.name.equals(name)){
                return codeEnums.code;
            }
        }
        return "";
    }
}
