package com.joyintech.tams.common.base.entity;

import com.joyintech.framework.constant.GlobalConstant;
import com.joyintech.framework.util.StringUtil;

import java.util.List;

public enum ChbMonthAssetRule {
	现金及活期存款("AMT1_1_1","1.1.1 现金及活期存款","ASSETTYPE2","1001","1.1 现金及银行存款"),//现金及活期存款待定
	本行存款("AMT1_1_2","1.1.2 本行存款","ASSETTYPE2","1002","1.1 现金及银行存款"),
	他行存款("AMT1_1_3","1.1.3 他行存款","ASSETTYPE2","1003","1.1 现金及银行存款"),
	本行发行的大额存单("AMT1_1_4","1.1.4 本行发行的大额存单","ASSETTYPE2","1004","1.1 现金及银行存款"),
	他行发行的大额存单("AMT1_1_5","1.1.5 他行发行的大额存单","ASSETTYPE2","1005","1.1 现金及银行存款"),
	合计1_1_6("AMT1_1_6","1.1.6 合计","","","1.1 现金及银行存款"),

	本行发行的同业存单("AMT1_2_1","1.2.1 本行发行的同业存单","ASSETTYPE2","2501","1.2 同业存单"),
	他行发行的同业存单("AMT1_2_2","1.2.2 他行发行的同业存单","ASSETTYPE2","2502","1.2 同业存单"),
	合计1_2_3("AMT1_2_3","1.2.3 合计","","","1.2 同业存单"),

	拆放同业("AMT1_3_1","1.3.1 拆放同业","ASSETTYPE2","1107","1.3 拆放同业及债券买入返售"),
	债券买入返售("AMT1_3_2","1.3.2 债券买入返售","ASSETTYPE2","1108","1.3 拆放同业及债券买入返售"),
	合计1_3_3("AMT1_3_3","1.3.3 合计","","","1.3 拆放同业及债券买入返售"),

	国债("AMT1_4_1","1.4.1 国债","ASSETTYPE2","1101","1.4 债券"),
	地方政府债券("AMT1_4_2","1.4.2 地方政府债券","ASSETTYPE2","1110","1.4 债券"),
	专项债券("AMT1_4_2_a","其中：1.4.2.a 专项债券","ASSETTYPE2,BANKSECZXZQ","1110,01","1.4 债券"),
	中央银行票据("AMT1_4_3","1.4.3 中央银行票据","ASSETTYPE2","1109","1.4 债券"),
	政府机构债券("AMT1_4_4","1.4.4 政府机构债券","ASSETTYPE2","1111","1.4 债券"),
	政策性金融债券("AMT1_4_5","1.4.5 政策性金融债券","ASSETTYPE2","1102","1.4 债券"),
	商业性金融债券("AMT1_4_6","1.4.6 商业性金融债券","ASSETTYPE2","1112","1.4 债券"),
	企业债券("AMT1_4_7","1.4.7 企业债券","ASSETTYPE2","1113","1.4 债券"),
	公司债券("AMT1_4_8","1.4.8 公司债券","ASSETTYPE2","1114","1.4 债券"),
	企业债务融资工具("AMT1_4_9","1.4.9 企业债务融资工具","ASSETTYPE2","1115","1.4 债券"),
	资产支持证券("AMT1_4_10","1.4.10 资产支持证券","ASSETTYPE2","1116","1.4 债券"),
	外国债券不含QDII债券("AMT1_4_11","1.4.11 外国债券（不含QDII债券）","ASSETTYPE2","1117","1.4 债券"),
	非标转标资产("AMT1_4_12","1.4.12 非标转标资产","ASSETTYPE2,ISFBZB","1201|1210|1202|1203|1204|1205|1206|1207|1208|1209|1299|2101|2201|2202|2299,01","1.4 债券"),
	其他债券("AMT1_4_13","1.4.13 其他债券","","","1.4 债券"),
	//	其他债券("AMT1_4_12","1.4.12 其他债券","",""),
	合计1_4_14("AMT1_4_14","1.4.14 合计","","","1.4 债券"),
	信用债券1_4_a("AMT1_4_a","其中: 1.4.a AA+（含）以上信用债券","RATINGAA+","AA+","1.4 债券"),
	信用债券1_4_b("AMT1_4_b","1.4.b AA+以下信用债券","RATINGAA-","AA+","1.4 债券"),
	无评级信用债券("AMT1_4_c","1.4.c 无评级信用债券","RATINGNUll","NULL","1.4 债券"),

	票据类("AMT1_5_1","1.5.1 票据类","ASSETTYPE2,ISFBZB","1201,!01","1.5 非标准化债权类资产"),
	标准化票据("AMT1_5_1_a","其中：1.5.1.a 标准化票据","ASSETTYPE2,ISBZHPJ,ISFBZB","1201,01,!01","1.5 非标准化债权类资产"),
	信用证("AMT1_5_2","1.5.2 信用证","ASSETTYPE2,ISFBZB","1210,!01","1.5 非标准化债权类资产"),
	信托贷款("AMT1_5_3","1.5.3 信托贷款","ASSETTYPE2,ISFBZB","1202,!01","1.5 非标准化债权类资产"),
	委托贷款("AMT1_5_4","1.5.4 委托贷款","ASSETTYPE2,ISFBZB","1203,!01","1.5 非标准化债权类资产"),
	信贷资产转让("AMT1_5_5","1.5.5 信贷资产转让","ASSETTYPE2,ISFBZB","1204,!01","1.5 非标准化债权类资产"),
	收受益权("AMT1_5_6","1.5.6 收/受益权","ASSETTYPE2,ISFBZB","1205,!01","1.5 非标准化债权类资产"),
	委托债权("AMT1_5_7","1.5.7 委托债权","ASSETTYPE2,ISFBZB","1206,!01","1.5 非标准化债权类资产"),
	应收账款("AMT1_5_8","1.5.8 应收账款","ASSETTYPE2,ISFBZB","1207,!01","1.5 非标准化债权类资产"),
	带回购条款的股权性融资("AMT1_5_9","1.5.9 带回购条款的股权性融资","ASSETTYPE2,ISFBZB","1208,!01","1.5 非标准化债权类资产"),
	债权融资类产品("AMT1_5_10","1.5.10 债权融资类产品","ASSETTYPE2,ISFBZB","1209,!01","1.5 非标准化债权类资产"),
	同业借款1_5_11("AMT1_5_11","1.5.11 同业借款","ASSETTYPE2","9999","1.5 非标准化债权类资产"),
	收益凭证("AMT1_5_12","1.5.12 收益凭证","ASSETTYPE2","9999","1.5 非标准化债权类资产"),
	债权投资计划和资产支持计划("AMT1_5_13","1.5.13 债权投资计划和资产支持计划","ASSETTYPE2","9999","1.5 非标准化债权类资产"),
	理财直接融资工具("AMT1_5_14","1.5.14 理财直接融资工具","ASSETTYPE2,ISFBZB","2101,!01","1.5 非标准化债权类资产"),
	信贷资产流转和收益权转让产品("AMT1_5_15","1.5.15 信贷资产流转和收益权转让产品","ASSETTYPE2,ISFBZB","2201|2202|2299,!01","1.5 非标准化债权类资产"),
	其他非标准化债权类投资("AMT1_5_16","1.5.16 其他非标准化债权类投资","ASSETTYPE2,ISFBZB","1299,!01","1.5 非标准化债权类资产"),

	场内股票质押回购("AMT1_5_16_a"," 其中：1.5.16.a 场内股票质押回购","ASSETTYPE2,INASSETTYPE,ISFBZB","1299,01,!01","1.5 非标准化债权类资产"),
	场外股票质押融资("AMT1_5_16_b","1.5.16.b 场外股票质押融资","ASSETTYPE2,INASSETTYPE,ISFBZB","1299,02,!01","1.5 非标准化债权类资产"),
	投向地方政府融资平台的部分("AMT1_5_17_a","其中：1.5.a 投向地方政府融资平台的部分","ASSETTYPE2,MONITTYPE,ISFBZB","1201|1210|1202|1203|1204|1205|1206|1207|1208|1209|1299|2101|2201|2202|2299,01,!01","1.5 非标准化债权类资产"),

	合计1_5_17("AMT1_5_17","1.5.17 合计","","",""),
	股权("AMT1_6_1","1.6.1 股权","ASSETTYPE2","1301","1.6 权益类投资"),
	股票一级市场("AMT1_6_2","1.6.2 股票（一级市场）","ASSETTYPE2","1305","1.6 权益类投资"),
	股票二级市场("AMT1_6_3","1.6.3 股票（二级市场）","ASSETTYPE2","1302","1.6 权益类投资"),
	其他权益类投资("AMT1_6_4","1.6.4 其他权益类投资","ASSETTYPE2","1399","1.6 权益类投资"),
	合计1_6_5("AMT1_6_5","1.6.5 合计","","","1.6 权益类投资"),

	远期("AMT1_7_1","1.7.1 远期","ASSETTYPE2","1401","1.7 金融衍生品"),
	互换("AMT1_7_2","1.7.2 互换","ASSETTYPE2","1402","1.7 金融衍生品"),
	期货("AMT1_7_3","1.7.3 期货","ASSETTYPE2","1403","1.7 金融衍生品"),
	期权("AMT1_7_4","1.7.4 期权","ASSETTYPE2","1404","1.7 金融衍生品"),
	债券借贷("AMT1_7_5","1.7.5 债券借贷","ASSETTYPE2","1405","1.7 金融衍生品"),
	权证("AMT1_7_6","1.7.6 权证","ASSETTYPE2","1406","1.7 金融衍生品"),
	其他金融衍生品("AMT1_7_7","1.7.7 其他金融衍生品","ASSETTYPE2","1499","1.7 金融衍生品"),
	合计1_7_8("AMT1_7_8","1.7.8 合计","","","1.7 金融衍生品"),

	QDII债券("AMT1_8_1","1.8.1 QDII债券","ASSETTYPE2","1501","1.8 代客境外理财投资QDI"),
	QDII拆出("AMT1_8_2","1.8.2 QDII拆出","ASSETTYPE2","1504","1.8 代客境外理财投资QDI"),
	QDII逆回购("AMT1_8_3","1.8.3 QDII逆回购","ASSETTYPE2","1506","1.8 代客境外理财投资QDI"),
	QDII债券型基金("AMT1_8_4","1.8.4 QDII债券型基金","ASSETTYPE2","1507","1.8 代客境外理财投资QDI"),
	QDII货币型基金("AMT1_8_5","1.8.5 QDII货币型基金","ASSETTYPE2","1508","1.8 代客境外理财投资QDI"),
	QDII混合型基金("AMT1_8_6","1.8.6 QDII混合型基金","ASSETTYPE2","1509","1.8 代客境外理财投资QDI"),
	QDII股票型基金("AMT1_8_7","1.8.7 QDII股票型基金","ASSETTYPE2","1505","1.8 代客境外理财投资QDI"),
	QDII股票("AMT1_8_8","1.8.8 QDII股票","ASSETTYPE2","1502","1.8 代客境外理财投资QDI"),
	QDII结构性票据("AMT1_8_9","1.8.9 QDII结构性票据","ASSETTYPE2","1503","1.8 代客境外理财投资QDI"),
	其他代客境外理财投资QDII("AMT1_8_10","1.8.10 其他代客境外理财投资QDII","ASSETTYPE2","1599","1.8 代客境外理财投资QDI"),
	合计1_8_11("AMT1_8_11","1.8.11 合计","","","1.8 代客境外理财投资QDI"),


	贵金属类("AMT1_9_1","1.9.1 贵金属类","ASSETTYPE2","1601","1.9 商品类资产"),
	大宗商品类("AMT1_9_2","1.9.2 大宗商品类","ASSETTYPE2","1602","1.9 商品类资产"),
	其他商品类资产("AMT1_9_3","1.9.3 其他商品类资产","ASSETTYPE2","1699","1.9 商品类资产"),
	合计1_9_4("AMT1_9_4","1.9.4 合计","","","1.9 商品类资产"),

	字画类艺术品("AMT1_10_1","1.10.1 字画类艺术品","ASSETTYPE2","2301","1.10 另类资产"),
	古董类艺术品("AMT1_10_2","1.10.2 古董类艺术品","ASSETTYPE2","2302","1.10 另类资产"),
	其他类艺术品("AMT1_10_3","1.10.3 其他类艺术品","ASSETTYPE2","2303","1.10 另类资产"),
	影视等知识产权("AMT1_10_4","1.10.4 影视等知识产权","ASSETTYPE2","2304","1.10 另类资产"),
	酒("AMT1_10_5","1.10.5 酒","ASSETTYPE2","2305","1.10 另类资产"),
	其他另类资产("AMT1_10_6","1.10.6 其他另类资产","ASSETTYPE2","1603","1.10 另类资产"),
	合计1_10_7("AMT1_10_7","1.10.7 合计","","","1.10 另类资产"),

	债券基金("AMT1_11_1","1.11.1 债券基金","ASSETTYPE2","1106","1.11 公募基金"),
	货币市场基金("AMT1_11_2","1.11.2 货币市场基金","ASSETTYPE2","2401","1.11 公募基金"),
	股票基金("AMT1_11_3","1.11.3 股票基金","ASSETTYPE2","1303","1.11 公募基金"),
	基金中基金("AMT1_11_4","1.11.4 基金中基金","ASSETTYPE2","2403","1.11 公募基金"),
	混合基金("AMT1_11_5","1.11.5 混合基金","ASSETTYPE2","2402","1.11 公募基金"),
	其他公募基金("AMT1_11_6","1.11.6 其他公募基金","ASSETTYPE2","2499","1.11 公募基金"),
	合计1_11_7("AMT1_11_7","1.11.7 合计","","","1.11 公募基金"),

	私募证券投资基金("AMT1_12_1","1.12.1 私募证券投资基金","ASSETTYPE2","2601|2602|2604|2605|2606","1.12 私募基金"),
	权益类基金("AMT1_12_1_1","其中：1.12.1.1 权益类基金","ASSETTYPE2","2601","1.12 私募基金"),
	固收类基金("AMT1_12_1_2","1.12.1.2 固收类基金","ASSETTYPE2","2602","1.12 私募基金"),
	混合类基金("AMT1_12_1_3","1.12.1.3 混合类基金","ASSETTYPE2","2604","1.12 私募基金"),
	期货类及其他衍生品类基金("AMT1_12_1_4","1.12.1.4 期货类及其他衍生品类基金","ASSETTYPE2","2605","1.12 私募基金"),
	其他类基金1_12_1_5("AMT1_12_1_5","1.12.1.5 其他类基金","ASSETTYPE2","2606","1.12 私募基金"),
	私募股权投资基金("AMT1_12_2","1.12.2 私募股权投资基金","ASSETTYPE2","2607|2610|2611|2612|2617","1.12 私募基金"),
	上市公司定增基金("AMT1_12_2_1","其中：1.12.2.1 上市公司定增基金","ASSETTYPE2","2607","1.12 私募基金"),
	并购基金("AMT1_12_2_2","1.12.2.2 并购基金","ASSETTYPE2","2610","1.12 私募基金"),
	房地产基金("AMT1_12_2_3","1.12.2.3 房地产基金","ASSETTYPE2","2611","1.12 私募基金"),
	基础设施基金("AMT1_12_2_4","1.12.2.4 基础设施基金","ASSETTYPE2","2612","1.12 私募基金"),
	其他类基金1_12_2_5("AMT1_12_2_5","1.12.2.5 其他类基金","ASSETTYPE2","2617","1.12 私募基金"),
	创业投资基金("AMT1_12_3","1.12.3 创业投资基金","ASSETTYPE2","2613","1.12 私募基金"),
	其他私募投资基金("AMT1_12_4","1.12.4 其他私募投资基金","ASSETTYPE2","2699|2614","1.12 私募基金"),
	私募证券类FOF基金("AMT1_12_5","1.12.5 私募证券类FOF基金","ASSETTYPE2","2616","1.12 私募基金"),
	私募股权投资类FOF基金("AMT1_12_6","1.12.6 私募股权投资类FOF基金","ASSETTYPE2","2618","1.12 私募基金"),
	创业投资类FOF基金("AMT1_12_7","1.12.7 创业投资类FOF基金","ASSETTYPE2","2619","1.12 私募基金"),
	其他私募投资类FOF基金("AMT1_12_8","1.12.8 其他私募投资类FOF基金","ASSETTYPE2","2620","1.12 私募基金"),
	合计1_12_9("AMT1_12_9","1.12.9 合计","","","1.12 私募基金"),
	其中投向金融资产投资公司或其附属机构发行的私募股权投资基金AMT1_12_9_a("AMT1_12_9_a","其中：1.12.9.a投向金融资产投资公司或其附属机构发行的私募股权投资基金",
			"ASSETTYPE2,PRIVATEFUNDFLAG","2601|2602|2604|2605|2606|2607|2610|2611|2612|2617|2613|2699|2616|2618|2619|2620,01","1.12 私募基金"),

	信托产品("AMT1_13_1","1.13.1 信托产品","ASSETTYPE2","1701","1.13 资产管理产品"),
	自主管理1_13_1_1("AMT1_13_1_1","其中:1.13.1.1 自主管理","ASSETTYPE2,MANAGETYPE","1701,01","1.13 资产管理产品"),
	委托管理1_13_1_2("AMT1_13_1_2","1.13.1.2 委托管理","ASSETTYPE2,MANAGETYPE","1701,02|99","1.13 资产管理产品"),
	券商资产管理产品("AMT1_13_2","1.13.2 券商资产管理产品","ASSETTYPE2","1703","1.13 资产管理产品"),
	自主管理1_13_2_1("AMT1_13_2_1","其中:1.13.2.1 自主管理","ASSETTYPE2,MANAGETYPE","1703,01","1.13 资产管理产品"),
	委托管理1_13_2_2("AMT1_13_2_2","1.13.2.2 委托管理","ASSETTYPE2,MANAGETYPE","1703,02|99","1.13 资产管理产品"),
	基金资产管理产品("AMT1_13_3","1.13.3 基金资产管理产品","ASSETTYPE2","1704","1.13 资产管理产品"),
	自主管理1_13_3_1("AMT1_13_3_1","其中:1.13.3.1 自主管理","ASSETTYPE2,MANAGETYPE","1704,01","1.13 资产管理产品"),
	委托管理1_13_3_2("AMT1_13_3_2","1.13.3.2 委托管理","ASSETTYPE2,MANAGETYPE","1704,02|99","1.13 资产管理产品"),
	期货资产管理产品("AMT1_13_4","1.13.4 期货资产管理产品","ASSETTYPE2","1706","1.13 资产管理产品"),
	自主管理1_13_4_1("AMT1_13_4_1","其中:1.13.4.1 自主管理","ASSETTYPE2,MANAGETYPE","1706,01","1.13 资产管理产品"),
	委托管理1_13_4_2("AMT1_13_4_2","1.13.4.2 委托管理","ASSETTYPE2,MANAGETYPE","1706,02|99","1.13 资产管理产品"),
	保险资产管理产品("AMT1_13_5","1.13.5 保险资产管理产品","ASSETTYPE2","1702","1.13 资产管理产品"),
	自主管理1_13_5_1("AMT1_13_5_1","其中:1.13.5.1 自主管理","ASSETTYPE2,MANAGETYPE","1702,01","1.13 资产管理产品"),
	委托管理1_13_5_2("AMT1_13_5_2","1.13.5.2 委托管理","ASSETTYPE2,MANAGETYPE","1702,02|99","1.13 资产管理产品"),
	其他资产管理产品("AMT1_13_6","1.13.6 其他资产管理产品","ASSETTYPE2","1705","1.13 资产管理产品"),
	自主管理1_13_6_1("AMT1_13_6_1","其中:1.13.6.1 自主管理","ASSETTYPE2,MANAGETYPE","1705,01","1.13 资产管理产品"),
	委托管理1_13_6_2("AMT1_13_6_2","1.13.6.2 委托管理","ASSETTYPE2,MANAGETYPE","1705,02|99","1.13 资产管理产品"),
	合计1_13_7("AMT1_13_7","1.13.7 合计","","","1.13 资产管理产品"),
	其中投向金融资产投资公司发行的私募资产管理产品1_13_7_a("AMT1_13_7_a","其中：1.13.7.a投向金融资产投资公司发行的私募资产管理产品","ASSETTYPE2,PRIVATEPRDFLAG","1701|1702|1703|1704|1705|1706,01","1.13 资产管理产品"),

	银行("AMT1_14_1","1.14.1 银行","ASSETTYPE2","2801","1.14 委外投资——协议方式"),
	信托公司("AMT1_14_2","1.14.2 信托公司","ASSETTYPE2","2802","1.14 委外投资——协议方式"),
	证券公司("AMT1_14_3","1.14.3 证券公司","ASSETTYPE2","2803","1.14 委外投资——协议方式"),
	基金公司("AMT1_14_4","1.14.4 基金公司","ASSETTYPE2","2804","1.14 委外投资——协议方式"),
	期货公司("AMT1_14_5","1.14.5 期货公司","ASSETTYPE2","2805","1.14 委外投资——协议方式"),
	保险公司("AMT1_14_6","1.14.6 保险公司","ASSETTYPE2","2806","1.14 委外投资——协议方式"),
	其他1_14_7("AMT1_14_7","1.14.7 其他","ASSETTYPE2","2899","1.14 委外投资——协议方式"),
	合计1_14_8("AMT1_14_8","1.14.8 合计","","","1.14 委外投资——协议方式"),

	合计1_15("AMT1_15","1.15 合计","","","1.15 合计"),
	投向公共私营合作项目PPP的部分("AMT1_15_a","其中：1.15.a 投向“公共私营合作项目”（PPP）的部分","ASSETTYPE2,ASSETTYPE2,ASSETTYPE2,PPPFLAG","!1901,!1902,!2000,01","其中：1.15.a 投向“公共私营合作项目”（PPP）的部分"),
	投向市场化债转股相关产品的部分("AMT1_15_b","其中：1.15.b 投向市场化债转股相关产品的部分","ASSETTYPE2,ASSETTYPE2,ASSETTYPE2,BONDTOSTOCKFLAG","!1901,!1902,!2000,01","其中：1.15.b 投向市场化债转股相关产品的部分"),
	逾期资产合计("AMT1_15_c","其中：1.15.c 逾期资产合计","","","其中：1.15.c 逾期资产合计"),

	同业拆入("AMT2_1_1","2.1.1 同业拆入","ASSETTYPE2","1901","2.1 同业拆入及卖出回购"),
	卖出回购("AMT2_1_2","2.1.2 卖出回购","ASSETTYPE2","1902","2.1 同业拆入及卖出回购"),
	合计2_1_3("AMT2_1_3","2.1.3 合计","","","2.1 同业拆入及卖出回购"),

	其他负债("AMT2_2","2.2 其他(负债）","ASSETTYPE2","2000","2.2 其他(负债）"),
	同业借款2_2_1("AMT2_2_1","其中：2.2.1 同业借款","ASSETTYPE2","9999","其中：2.2.1 同业借款"),
	合计2_3("AMT2_3","2.3 合计","","","2.3 合计"),

	创业投资基金3_1_1("AMT3_1_1","3.1.1 创业投资基金","ISGOVERNFUND1","01","3.1 创业投资基金和政府出资产业投资基金"),
	政府出资产业投资基金("AMT3_1_2","3.1.2 政府出资产业投资基金","ISUNLISTED","01","3.1 创业投资基金和政府出资产业投资基金"),
	合计3_1_3("AMT3_1_3","3.1.3 合计","","","3.1 创业投资基金和政府出资产业投资基金"),

	优先股("AMT3_2_1","3.2.1 优先股","BANKSECPREFER","01","3.2 银行资本补充工具"),
	永续债("AMT3_2_2","3.2.2 永续债","BANKSECPERPETUAL","01","3.2 银行资本补充工具"),
	二级资本债("AMT3_2_3","3.2.3 二级资本债","BANKSECCAPITAL","01","3.2 银行资本补充工具"),
	可转债("AMT3_2_4","3.2.4 可转债","BANKSECKZZQ","01","3.2 银行资本补充工具"),
	其他银行资本补充工具("AMT3_2_5","3.2.5 其他银行资本补充工具","ASSETTYPE2","9999","3.2 银行资本补充工具"),
	合计3_2_6("AMT3_2_6","3.2.6 合计","","","3.2 银行资本补充工具"),


	农林牧渔业("AMT3_3_1","3.3.1 农林牧渔业","ASSETTYPE2,INDUSTRY1,ISFBZB","1201|1210|1202|1203|1204|1205|1206|1207|1208|1209|1299|2201|2202|2101|2299,01,!01","3.3 穿透后投向为非标准化债权类资产的行业归属"),
	制造业("AMT3_3_2","3.3.2 制造业","ASSETTYPE2,INDUSTRY1,ISFBZB","1201|1210|1202|1203|1204|1205|1206|1207|1208|1209|1299|2201|2202|2101|2299,03,!01","3.3 穿透后投向为非标准化债权类资产的行业归属"),
	采矿业("AMT3_3_3","3.3.3 采矿业","ASSETTYPE2,INDUSTRY1,ISFBZB","1201|1210|1202|1203|1204|1205|1206|1207|1208|1209|1299|2201|2202|2101|2299,02,!01","3.3 穿透后投向为非标准化债权类资产的行业归属"),
	建筑业("AMT3_3_4","3.3.4 建筑业","ASSETTYPE2,INDUSTRY1,ISFBZB","1201|1210|1202|1203|1204|1205|1206|1207|1208|1209|1299|2201|2202|2101|2299,05,!01","3.3 穿透后投向为非标准化债权类资产的行业归属"),
	基础设施建设("AMT3_3_5","3.3.5 基础设施建设","ASSETTYPE2,INDUSTRY1,ISFBZB","1201|1210|1202|1203|1204|1205|1206|1207|1208|1209|1299|2201|2202|2101|2299,04|07|14,!01","3.3 穿透后投向为非标准化债权类资产的行业归属"),
	房地产业("AMT3_3_6","3.3.6 房地产业","ASSETTYPE2,INDUSTRY1,ISFBZB","1201|1210|1202|1203|1204|1205|1206|1207|1208|1209|1299|2201|2202|2101|2299,11,!01","3.3 穿透后投向为非标准化债权类资产的行业归属"),
	金融业("AMT3_3_7","3.3.7 金融业","ASSETTYPE2,INDUSTRY1,ISFBZB","1201|1210|1202|1203|1204|1205|1206|1207|1208|1209|1299|2201|2202|2101|2299,10,!01","3.3 穿透后投向为非标准化债权类资产的行业归属"),
	其他服务业("AMT3_3_8","3.3.8 其他服务业","ASSETTYPE2,INDUSTRY1,ISFBZB","1201|1210|1202|1203|1204|1205|1206|1207|1208|1209|1299|2201|2202|2101|2299,06|08|09|12|13|15|16|17|18|19|20|NULL,!01","3.3 穿透后投向为非标准化债权类资产的行业归属"),
	合计3_2_9("AMT3_3_9","3.3.9 合计","","","3.3 穿透后投向为非标准化债权类资产的行业归属"),
	;
	/**
	 * 属性代码 
	 */
	private String propertyCode;

	/**
	 * 属性名称
	 */
	private String propertyName;

	/**
	 * 属性映射规则列表，关联chb_month_asset_position中的字段名,以逗号隔开
	 */
	private List<String> ruleCodeList;

	/**
	 * 属性映射规则值，与属性映射规则列表中对应的取值
	 */
	private List<String> ruleValueList;

	/**
	 * 属性明细大分类
	 */
	private String propertyCategoied;

	ChbMonthAssetRule(String propertyCode, String propertyName, String ruleCodeList, String ruleValueList,String propertyCategoied){
		this.propertyCode = propertyCode;
		this.propertyName = propertyName;
		this.ruleCodeList = StringUtil.splitToList(GlobalConstant.COMMA, ruleCodeList);
		this.ruleValueList = StringUtil.splitToList(GlobalConstant.COMMA, ruleValueList);
		this.propertyCategoied = propertyCategoied;
	}

	public String getPropertyCode() {
		return propertyCode;
	}

	public void setPropertyCode(String propertyCode) {
		this.propertyCode = propertyCode;
	}

	public String getPropertyName() {
		return propertyName;
	}

	public void setPropertyName(String prepertyName) {
		this.propertyName = prepertyName;
	}

	public List<String> getRuleCodeList() {
		return ruleCodeList;
	}

	public void setRuleCodeList(List<String> ruleCodeList) {
		this.ruleCodeList = ruleCodeList;
	}

	public List<String> getRuleValueList() {
		return ruleValueList;
	}

	public void setRuleValueList(List<String> ruleValueList) {
		this.ruleValueList = ruleValueList;
	}

	public String getPropertyCategoied() {
		return propertyCategoied;
	}

	public void setPropertyCategoied(String propertyCategoied) {
		this.propertyCategoied = propertyCategoied;
	}
}
